ka2_2024/src/Enums/ТипыДоговоров/ТипыДоговоров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыДоговоров</name>
  <enumValues>
    <name>СПокупателем</name>
  </enumValues>
  <enumValues>
    <name>СКомиссионером</name>
  </enumValues>
  <enumValues>
    <name>СПоставщиком</name>
  </enumValues>
  <enumValues>
    <name>СКомитентом</name>
  </enumValues>
  <enumValues>
    <name>Импорт</name>
  </enumValues>
  <enumValues>
    <name>ВвозИзЕАЭС</name>
  </enumValues>
  <enumValues>
    <name>СДавальцем</name>
  </enumValues>
  <enumValues>
    <name>СДавальцем2_5</name>
  </enumValues>
  <enumValues>
    <name>СПереработчиком</name>
  </enumValues>
  <enumValues>
    <name>СПоклажедателем</name>
  </enumValues>
  <enumValues>
    <name>СХранителем</name>
  </enumValues>
  <enumValues>
    <name>СКомитентомНаЗакупку</name>
    <comment>00004303</comment>
  </enumValues>
  <enumValues>
    <name>СПереработчиком2_5</name>
  </enumValues>
  <enumValues>
    <name>РеализацияЧерезКомиссионера</name>
  </enumValues>
  <enumValues>
    <name>СПереработчиком2_5_ЕАЭС</name>
  </enumValues>
</mdclass:Enum>

ka2_2024/src/Catalogs/ТипыПлатежейФЗ275/ТипыПлатежейФЗ275.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ТипыПлатежейФЗ275</name>
  <predefined>
    <items>
      <name>ВозвратНаРасчетныйСчетРанееПолученныхСумм</name>
      <description>Возврат на расчетный счет ранее полученных сумм</description>
    </items>
    <items>
      <name>ВыплатыПоТрудовомуКодексуРФ</name>
      <description>Выплаты по трудовому кодексу РФ</description>
    </items>
    <items>
      <name>ОплатаИныхРасходовВПределахУстановленнойСуммыВМесяц</name>
      <description>Оплата иных расходов в пределах установленной суммы в месяц</description>
    </items>
    <items>
      <name>ОплатаТоваровРаботУслугПоРегулируемымЦенам</name>
      <description>Оплата товаров, работ, услуг, по ценам, подлежащим государственному регулированию</description>
    </items>
    <items>
      <name>ОплатаТруда</name>
      <description>Оплата труда работников предприятия (при одновременной уплате соответствующих налогов и взносов)</description>
    </items>
    <items>
      <name>ПеречислениеДенежныхСредствПослеЗавершенияГосконтракта</name>
      <description>Перечисление денежных средств после завершения госконтракта</description>
    </items>
    <items>
      <name>ПеречислениеМеждуОтдельнымиСчетамиКонтракта</name>
      <description>Перечисление между отдельными счетами контракта</description>
    </items>
    <items>
      <name>ПеречислениеПрибылиГоловномуИсполнителю</name>
      <description>Перечисление прибыли головному исполнителю в рамках частичного исполнения госконтракта на поставку товара, в размере, согласованном госзаказчиком</description>
    </items>
    <items>
      <name>ПеречисленияПрибылиИсполнителю</name>
      <description>Перечисление прибыли исполнителю, в пределах размера прибыли, предусмотренного условиями контракта</description>
    </items>
    <items>
      <name>РасчетыСИностраннымиИсполнителями</name>
      <description>Расчеты с иностранными исполнителями, в соответствии с утверждённым перечнем</description>
    </items>
    <items>
      <name>СписаниеНаВозмещениеЗатратЗаСчетСобственныхСредств</name>
      <description>Списание денежных средств, направленных на возмещение затрат за счёт собственных средств на формирование запасов по контракту</description>
    </items>
    <items>
      <name>СписаниеНаОтдельныйСчет</name>
      <description>Списание на отдельный счет</description>
    </items>
    <items>
      <name>СписаниеПоИсполнительнымДокументам</name>
      <description>Списание по исполнительным документам</description>
    </items>
    <items>
      <name>СписаниеСуммКредитовПеречисленныхУполномоченнымБанком</name>
      <description>Списание сумм процентов и кредитов, ранее перечисленных уполномоченным банком на отдельный счёт</description>
    </items>
    <items>
      <name>СписаниеСвязанноеСРазмещениемНаДепозитеУполномоченногоБанка</name>
      <description>Списание, связанное с размещением денежных средств на депозите в уполномоченном банке</description>
    </items>
    <items>
      <name>УплатаНалоговИСборовТаможенныхПлатежейСтраховыхВзносов</name>
      <description>Уплата налогов и сборов, таможенных платежей, страховых взносов</description>
    </items>
  </predefined>
  <attributes>
    <name>ОписаниеПунктаЗакона</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерПунктаЗакона</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НеТребуютсяДокументыПодтвержденияИсполненияКонтракта</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ПодтверждающиеДокументы</name>
    <attributes>
      <name>ВидДокумента</name>
      <type>
        <types>CatalogRef.ВидыПодтверждающихДокументов</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

ka2_2024/src/Catalogs/ВидыПодтверждающихДокументов/ВидыПодтверждающихДокументов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ВидыПодтверждающихДокументов</name>
  <predefined>
    <items>
      <name>АктВыполненныхРабот</name>
      <description>Акт выполненных работ</description>
    </items>
    <items>
      <name>АктОказанныхУслуг</name>
      <description>Акт оказанных услуг</description>
    </items>
    <items>
      <name>АктПриемаПередачиТовара</name>
      <description>Акт приёма-передачи товаров</description>
    </items>
    <items>
      <name>ДепозитныйДоговор</name>
      <description>Депозитный договор</description>
    </items>
    <items>
      <name>ДополнительноеСоглашение</name>
      <description>Дополнительное соглашение к контракту между головным исполнителем и исполнителем, между исполнителями</description>
    </items>
    <items>
      <name>ИнойДокумент</name>
      <description>Иной документ</description>
    </items>
    <items>
      <name>КарточкаСОбразцамиПодписей</name>
      <description>Карточка с образцами подписей и оттиска печати</description>
    </items>
    <items>
      <name>Контракт</name>
      <description>Контракт между головным исполнителем и исполнителем, между исполнителями</description>
    </items>
    <items>
      <name>КредитныйДоговор</name>
      <description>Кредитный договор</description>
    </items>
    <items>
      <name>РаспоряжениеНаПеречислениеДенежныхСредств</name>
      <description>Распоряжение на перечисление денежных средств</description>
    </items>
    <items>
      <name>Счет</name>
      <description>Счёт</description>
    </items>
    <items>
      <name>СчетФактура</name>
      <description>Счёт-фактура</description>
    </items>
    <items>
      <name>ТоварноТранспортнаяНакладная</name>
      <description>Товарно-транспортная накладная</description>
    </items>
    <items>
      <name>ТранспортнаяНакладная</name>
      <description>Транспортная накладная (форма &quot;ТОРГ-12&quot;)</description>
    </items>
    <items>
      <name>УниверсальныйПередаточныйДокумент</name>
      <description>Универсальный передаточный документ</description>
    </items>
  </predefined>
  <attributes>
    <name>КраткоеНаименование</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПодтверждаетИсполнениеКонтракта</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Catalog>

ka2_2024/src/CommonForms/ФормаГК/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
		
	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;
	УстановитьУсловноеОформление();
	Если ТипЗнч(Параметры.ДоговорСсылка) = Тип("СправочникСсылка.ДоговорыКонтрагентов") Тогда
		ТолькоПросмотр = НЕ ПравоДоступа("Изменение", Метаданные.Справочники.ДоговорыКонтрагентов);
	ИначеЕсли ТипЗнч(Параметры.ДоговорСсылка) = Тип("СправочникСсылка.ДоговорыМеждуОрганизациями") Тогда 
		ТолькоПросмотр = НЕ ПравоДоступа("Изменение", Метаданные.Справочники.ДоговорыМеждуОрганизациями);
	ИначеЕсли ТипЗнч(Параметры.ДоговорСсылка) = Тип("СправочникСсылка.ДоговорыКредитовИДепозитов") Тогда 
		ТолькоПросмотр = НЕ ПравоДоступа("Изменение", Метаданные.Справочники.ДоговорыКредитовИДепозитов);
	КонецЕсли;
	ТекущийПользователь = Пользователи.АвторизованныйПользователь();
	ДоговорКредитовИДепозитов = ТипЗнч(Параметры.ДоговорСсылка) = Тип("СправочникСсылка.ДоговорыКредитовИДепозитов");
	
	ЗаполнитьЗначенияСвойств(ЭтаФорма, Параметры, ДоговорыКонтрагентовЛокализацияКлиентСервер.ИменаРеквизитовГОЗ());
	
	//++ НЕ УТ
	РезультатПодтверждающиеДокументы = ПолучитьИзВременногоХранилища(АдресПодтверждающихДокументовВоВременномХранилище);
	ПодтверждающиеДокументы.Загрузить(РезультатПодтверждающиеДокументы);
	//-- НЕ УТ	
	
	УправлениеЭлементамиГосКонтрактов();
	УстановитьПараметрыВыбораДоговораСЗаказчиком();
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "Запись_Файл"
			И Параметр.Свойство("ВладелецФайла")
			И Параметр.ВладелецФайла = ДоговорСсылка
			И Параметр.ЭтоНовый
			И ДобавляетсяФайлПодтверждающегоДокумента Тогда
			
		Элементы.ПодтверждающиеДокументы.ТекущиеДанные.Файл = Источник[0];
		ДобавляетсяФайлПодтверждающегоДокумента = Ложь;
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	Если ПлатежиПо275ФЗ Тогда
		Если ТипДоговора = Перечисления.ТипыДоговоров.СПоставщиком
			И ВариантПлатежаГОЗ = 1 И Не ЗначениеЗаполнено(КонтрактСЗаказчиком) Тогда
			
			Текст = НСтр("ru = 'Поле ""Договор с заказчиком"" не заполнено.'");
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
				Текст,,
				"КонтрактСЗаказчиком",,
				Отказ);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ПлатежиПо275ФЗПриИзменении(Элемент)

	ДоговорСУчастникомГОЗ = ПлатежиПо275ФЗ;
	УправлениеЭлементамиГосКонтрактов();

КонецПроцедуры

&НаКлиенте
Процедура ВариантПлатежаГОЗПриИзменении(Элемент)
	
	
	ПлатежиПо275ФЗ = (ВариантПлатежаГОЗ <> 0);
	ДоговорСУчастникомГОЗ = (ВариантПлатежаГОЗ = 1);
	ОплатаРасходовПоТарифамСГосрегулированием = (ВариантПлатежаГОЗ = 2);
	
	ВариантПлатежаГОЗПриИзмененииНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ГосударственныйКонтрактПриИзменении(Элемент)
	ГосударственныйКонтрактПриИзмененииНаСервере();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыПодтверждающиеДокументы

&НаКлиенте
Процедура ПодтверждающиеДокументыВидДокументаПриИзменении(Элемент)
	
	
	ТекущиеДанные = Элементы.ПодтверждающиеДокументы.ТекущиеДанные;
	
	//++ НЕ УТ	
	
	ЗаполнитьНомерДатаСумма(ТекущиеДанные, ЭтаФорма);

	//-- НЕ УТ
	
КонецПроцедуры

&НаКлиенте
Процедура ПодтверждающиеДокументыФайлНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ПодтверждающиеДокументыФайлНачалоВыбораЗавершение", ЭтотОбъект);
	
	ПунктыМеню = Новый СписокЗначений;
	ПунктыМеню.Добавить("ВыборИзПрисоединенныхФайлов",
		НСтр("ru= 'Выбрать из присоединенных файлов ...'"),, БиблиотекаКартинок.ВыбратьЗначение);
	ПунктыМеню.Добавить("ДобавлениеФайлаСДиска",
		НСтр("ru= 'Добавить файл с диска ...'"),, БиблиотекаКартинок.ОткрытьФайл);
	
	ПоказатьВыборИзМеню(ОписаниеОповещения, ПунктыМеню, Элементы.ПодтверждающиеДокументыФайл);

КонецПроцедуры

&НаСервере
Процедура ВариантПлатежаГОЗПриИзмененииНаСервере()
	
	ТипПлатежаФЗ275 = Неопределено;
	
	//++ НЕ УТ
	
	Если ВариантПлатежаГОЗ = 1 Тогда
		ТипПлатежаФЗ275 = Справочники.ТипыПлатежейФЗ275.СписаниеНаОтдельныйСчет;
	КонецЕсли;

	//-- НЕ УТ
	
	УправлениеЭлементамиГосКонтрактов();
	УстановитьПараметрыВыбораДоговораСЗаказчиком();
КонецПроцедуры

&НаКлиенте
Процедура ПодтверждающиеДокументыФайлНачалоВыбораЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат <> Неопределено Тогда
		ДополнительныеПараметрыВыбораВладельца = Новый Структура("Действие", Результат.Значение);
		ВыборВладельцаФайлаЗавершение(Новый Структура("Значение", ДоговорСсылка), ДополнительныеПараметрыВыбораВладельца);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте 
Процедура ВыборВладельцаФайлаЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат <> Неопределено Тогда
		ВыбранныйВладелецФайла = Результат.Значение;
		
		Если ДополнительныеПараметры.Действие = "ДобавлениеФайлаСДиска" Тогда
			
			ИдентификаторФайла = Новый УникальныйИдентификатор;
			ДобавляетсяФайлПодтверждающегоДокумента = Истина;
			
			РаботаСФайламиКлиент.ДобавитьФайлы(ВыбранныйВладелецФайла, ИдентификаторФайла);
			
		ИначеЕсли ДополнительныеПараметры.Действие = "ВыборИзПрисоединенныхФайлов" Тогда
			
			РаботаСФайламиКлиент.ОткрытьФормуВыбораФайлов(ВыбранныйВладелецФайла, Элементы.ПодтверждающиеДокументыФайл);
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОК(Команда)
	ОчиститьСообщения();
	Если ПроверитьЗаполнение() Тогда
		ПоместитьДокументыВоВременноеХранилище();
		
		СтруктураРеквизитов = Новый Структура(ДоговорыКонтрагентовЛокализацияКлиентСервер.ИменаРеквизитовГОЗ());
		ЗаполнитьЗначенияСвойств(СтруктураРеквизитов, ЭтаФорма);
		Закрыть(СтруктураРеквизитов);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПросмотретьПодтверждающийДокумент(Команда)	
	Если Элементы.ПодтверждающиеДокументы.ТекущаяСтрока <> Неопределено Тогда
		Файл = Элементы.ПодтверждающиеДокументы.ТекущиеДанные.Файл;
		
		Если Файл = Неопределено Или Файл.Пустая() Тогда
			ПоказатьПредупреждение(,НСтр("ru= 'Файл подтверждающего документа не указан.'"));
			Возврат;
		КонецЕсли;
		
		РеквизитыФайла = РеквизитыОбъекта(Файл);
		
		Если РеквизитыФайла.Зашифрован Тогда
			Возврат;
		КонецЕсли;
		
		ДанныеФайла = ПолучитьДанныеФайла(Файл, УникальныйИдентификатор);
		РаботаСФайламиКлиент.ОткрытьФайл(ДанныеФайла, РеквизитыФайла.ФайлРедактируется);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПодтверждающиеДокументы(Команда)
	
	//++ НЕ УТ
	
	ЗаполнитьПодтверждающиеДокументыСервер();

	//-- НЕ УТ
	
	Возврат; // В УТ обработчик пустой
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УстановитьУсловноеОформление()

	//++ НЕ УТ

	УсловноеОформление.Элементы.Очистить();

	ВидыПодтверждающиеИсполнениеКонтракта = Новый СписокЗначений;
	ВидыПодтверждающиеИсполнениеКонтракта.ЗагрузитьЗначения(
		Справочники.ВидыПодтверждающихДокументов.ВидыПодтверждающиеИсполнениеКонтракта());

	// Текст незаполненного файла

	Элемент = УсловноеОформление.Элементы.Добавить();
	
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ПодтверждающиеДокументыФайл.Имя);

	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ПодтверждающиеДокументы.Файл");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.НеЗаполнено;
	
	Элемент.Оформление.УстановитьЗначениеПараметра("Текст", НСтр("ru= '<Указывается в заявке>'"));
	
	// Текст номера и даты для документов, подтверждающих исполнение контракта

	Элемент = УсловноеОформление.Элементы.Добавить();

	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ПодтверждающиеДокументыНомер.Имя);
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ПодтверждающиеДокументыДата.Имя);

	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ПодтверждающиеДокументы.ВидДокумента");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСписке;
	ОтборЭлемента.ПравоеЗначение = ВидыПодтверждающиеИсполнениеКонтракта;
	
	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветТекста", WebЦвета.Серый);
	Элемент.Оформление.УстановитьЗначениеПараметра("Текст", НСтр("ru= '<Указывается в заявке>'"));
	Элемент.Оформление.УстановитьЗначениеПараметра("ТолькоПросмотр", Истина);

	//-- НЕ УТ
	
КонецПроцедуры

&НаСервере
Функция РеквизитыОбъекта(ПодтверждающийДокумент)
	
	РеквизитыОбъекта = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ПодтверждающийДокумент, "Зашифрован, Редактирует");
	
	ФайлРедактируется = (ЗначениеЗаполнено(РеквизитыОбъекта.Редактирует) И РеквизитыОбъекта.Редактирует = ТекущийПользователь);
	РеквизитыОбъекта.Вставить("ФайлРедактируется", ФайлРедактируется);
	
	Возврат РеквизитыОбъекта;
	
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьДанныеФайла(Знач ПрисоединенныйФайл, Знач ИдентификаторФормы = Неопределено, Знач ПолучатьСсылкуНаДвоичныеДанные = Истина)
	
	Возврат РаботаСФайлами.ДанныеФайла(ПрисоединенныйФайл, ИдентификаторФормы, ПолучатьСсылкуНаДвоичныеДанные);
	
КонецФункции

//++ НЕ УТ

&НаСервере
Процедура ЗаполнитьПодтверждающиеДокументыСервер()

	ПодтверждающиеДокументы.Загрузить(ПолучитьИзВременногоХранилища(
		ДенежныеСредстваСерверЛокализация.ПодтверждающиеДокументыФЗ275(ТипПлатежаФЗ275, УникальныйИдентификатор)));
	
	Для каждого ПодтверждающийДокумент Из ПодтверждающиеДокументы Цикл
		ЗаполнитьНомерДатаСумма(ПодтверждающийДокумент, ЭтаФорма);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ЗаполнитьНомерДатаСумма(ДанныеСтроки, Форма)
	Если Не ДанныеСтроки = Неопределено Тогда
		Если ДанныеСтроки.ВидДокумента = ПредопределенноеЗначение("Справочник.ВидыПодтверждающихДокументов.КредитныйДоговор") 
			И Форма.ХарактерДоговора = ПредопределенноеЗначение("Перечисление.ХарактерыДоговоровФинансовыхИнструментов.КредитИлиЗайм") 
			Или ДанныеСтроки.ВидДокумента = ПредопределенноеЗначение("Справочник.ВидыПодтверждающихДокументов.ДепозитныйДоговор")
			И Форма.ХарактерДоговора = ПредопределенноеЗначение("Перечисление.ХарактерыДоговоровФинансовыхИнструментов.Депозит") Тогда
			ДанныеСтроки.Номер = Форма.Номер;
			ДанныеСтроки.Дата = Форма.Дата;
			ДанныеСтроки.Сумма = Форма.СуммаТраншей;
		ИначеЕсли ДанныеСтроки.ВидДокумента = ПредопределенноеЗначение("Справочник.ВидыПодтверждающихДокументов.Контракт") Тогда
			ДанныеСтроки.Номер = Форма.Номер;
			ДанныеСтроки.Дата = Форма.Дата;
			ДанныеСтроки.Сумма = Форма.Сумма;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

//-- НЕ УТ

&НаСервере
Процедура УправлениеЭлементамиГосКонтрактов()
	
	СЗаказчиком = (ТипДоговора = Перечисления.ТипыДоговоров.СПокупателем);
	СИсполнителем = (ТипДоговора = Перечисления.ТипыДоговоров.СПоставщиком);
	СПереработчиком = 
		ТипДоговора = Перечисления.ТипыДоговоров.СПереработчиком2_5
		Или ТипДоговора = Перечисления.ТипыДоговоров.СПереработчиком2_5_ЕАЭС
		//++ Устарело_Переработка24
		Или ТипДоговора = Перечисления.ТипыДоговоров.СПереработчиком
		//-- Устарело_Переработка24
		Или Ложь;
	
	КупляПродажа = (ТипДоговора = Перечисления.ТипыДоговоровМеждуОрганизациями.КупляПродажа);

	Элементы.ПодтверждающиеДокументы.Видимость =
		ПлатежиПо275ФЗ
		И (СЗаказчиком
		Или СИсполнителем
		Или СПереработчиком
		Или КупляПродажа
		Или ДоговорКредитовИДепозитов);
	
	// Специфика заказчика
	Элементы.ПлатежиПо275ФЗ.Видимость =
		СЗаказчиком
		Или Ложь;
	
	Элементы.ГосударственныйКонтрактЗаказчик.Видимость =
		(СЗаказчиком
			Или Ложь)
		И ПлатежиПо275ФЗ
		И ДоговорСУчастникомГОЗ;
		
	Элементы.ДекорацияОтступВыполненыОбязательстваГОЗ.Видимость =
		(СЗаказчиком
			Или Ложь)
		И ДоговорСУчастникомГОЗ
		И ПоддержкаПлатежей275ФЗ;
	
	Элементы.ВыполненыОбязательстваПоДоговоруГОЗ.Видимость =
		(СЗаказчиком
			Или КупляПродажа)
		И ДоговорСУчастникомГОЗ;
	
	// Специфика исполнителя
	Элементы.ВариантПлатежаПрочемуИсполнителю.Видимость =
		(СИсполнителем
			ИЛИ СПереработчиком
			ИЛИ КупляПродажа)
		И ПоддержкаПлатежей275ФЗ;
	
	Элементы.ВариантПлатежаУчастникуКооперации.Видимость =
		(СИсполнителем
			ИЛИ СПереработчиком
			ИЛИ КупляПродажа)
		И ПоддержкаПлатежей275ФЗ;
	
	Элементы.ВариантПлатежаПоТарифам.Видимость =
		(СИсполнителем
			ИЛИ КупляПродажа)
		И ПоддержкаПлатежей275ФЗ;
	
	Элементы.ГосударственныйКонтракт.Видимость =
		(СИсполнителем
			ИЛИ СПереработчиком
			ИЛИ КупляПродажа)
		И ПлатежиПо275ФЗ
		И ДоговорСУчастникомГОЗ;
	
	Элементы.КонтрактСЗаказчиком.Видимость =
		(СИсполнителем
			ИЛИ СПереработчиком
			ИЛИ КупляПродажа)
		И ВариантПлатежаГОЗ = 1;
	
	МассивПараметров = Новый Массив;
	МассивПараметров.Добавить(Новый ПараметрВыбора("Отбор.ПометкаУдаления", Ложь));
	
	ОтборОрганизаций = Справочники.Организации.МассивВзаимосвязанныхОрганизаций(Организация);
	ОтборОрганизаций.Добавить(Организация);
	МассивПараметров.Добавить(Новый ПараметрВыбора("Отбор.Организация", Новый ФиксированныйМассив(ОтборОрганизаций)));
	
	Элементы.КонтрактСЗаказчиком.ПараметрыВыбора = Новый ФиксированныйМассив(МассивПараметров);
	
КонецПроцедуры

&НаСервере
Процедура ГосударственныйКонтрактПриИзмененииНаСервере()
	Если ТипЗнч(ДоговорСсылка) = Тип("СправочникСсылка.ДоговорыКонтрагентов") Тогда
		КонтрактСЗаказчиком = ДоговорыКонтрагентовЛокализация.ПолучитьКонтрактСЗаказчиком(ГосударственныйКонтракт, Организация);
	ИначеЕсли ТипЗнч(ДоговорСсылка) = Тип("СправочникСсылка.ДоговорыМеждуОрганизациями") Тогда 
		КонтрактСЗаказчиком = ДоговорыМеждуОрганизациямиЛокализация.ПолучитьКонтрактСЗаказчиком(ГосударственныйКонтракт, ОрганизацияПолучатель);
	КонецЕсли;
	УстановитьПараметрыВыбораДоговораСЗаказчиком();
КонецПроцедуры

&НаСервере
Процедура ПоместитьДокументыВоВременноеХранилище()
	ПоместитьВоВременноеХранилище(ПодтверждающиеДокументы.Выгрузить(), АдресПодтверждающихДокументовВоВременномХранилище);
КонецПроцедуры

&НаСервере
Процедура УстановитьПараметрыВыбораДоговораСЗаказчиком()
	
	// Отберем контракты, в которых организация-покупатель является организацией-поставщиком.
	ДополнительныеПараметры = Новый Структура;
	Если ЗначениеЗаполнено(ОрганизацияПолучатель) Тогда
		ДополнительныеПараметры.Вставить("Организация", ОрганизацияПолучатель);
	Иначе
		ДополнительныеПараметры.Вставить("Организация", Организация);
	КонецЕсли;
	Если ВариантПлатежаГОЗ = 1 Тогда
		ДополнительныеПараметры.Вставить("ГосударственныйКонтракт", ГосударственныйКонтракт);
	КонецЕсли;
	
	ДенежныеСредстваСерверЛокализация.УстановитьПараметрыВыбораДоговораСЗаказчиком(Элементы.КонтрактСЗаказчиком, ДополнительныеПараметры);
	
КонецПроцедуры


#КонецОбласти
